Config/InformationRegisters/НастройкиНормРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиНормРасходаГСМ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоправочныеКоэффициентыРасчетаНормГСМ</v8:Type>
						<v8:Type>cfg:CatalogRef.ПоправочныеЗначенияРасчетаНормГСМ</v8:Type>
						<v8:Type>cfg:CatalogRef.НормыРасходаГСМ</v8:Type>
						<v8:Type>cfg:CatalogRef.НормыРасходаГСМДляАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредельныйПробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетПослеПревышенияПробегаИлиПредельногоСрокаЭксплуатации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетДоПревышенияПробега</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаКонтроляПробега</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредельнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредельнаяДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредельныйПробегОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазваниеНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаРасходаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовРасходаГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыОбъектовРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовРасходаГСМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Агрегаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыОперацийРеконструкцияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРеконструкцияОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КапРемонтОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодернизацияОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодернизацияНМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодернизацияНПА</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыСобытийОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСобытийОС</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реконструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие состояния (пользовательские)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзБезвозмездногоПользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Консервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расконсервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЛичноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзЛичногоПользования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/InformationRegisters/НастройкиНормРасходаГСМ/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ТС) Тогда
		Запись.Организация = Запись.ТС.Организация;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.Организация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.ВидОбъектаРасходаГСМ) Тогда
		Запись.ВидОбъектаРасходаГСМ = Перечисления.ВидыОбъектовРасходаГСМ.ТранспортныеСредства;
	КонецЕсли;
	
	Элементы.Настройка.СписокВыбора.Добавить("Норма расхода ГСМ");
	Элементы.Настройка.СписокВыбора.Добавить("Поправочное значение расхода ГСМ");
	Элементы.Настройка.СписокВыбора.Добавить("Поправочный коэффициент расхода ГСМ");
	
	УстановитьВидимостьЭлементов(ЭтаФорма);
	
	СоздатьКнопкуДляБыстрогоЗаполненияПоВариантам(ЭтаФорма, "ПредельнаяДата", Элементы.ГруппаЗаполнитьНастройкиПоВариантам);
	СоздатьКнопкуДляБыстрогоЗаполненияДатыКонтроляПробега(ЭтаФорма, "НачалоПериодаКонтроляПробега", Элементы.ГруппаНачалоПериодаКонтроляПробега);
	
	ДатаВводаВЭксплуатацию = ДатаВводаВЭксплуатациюТС();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи); 
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	Запись.НазваниеНастройки = Запись.Настройка;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Запись.ВидОбъектаРасходаГСМ) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не указан вид объекта расхода ГСМ. Выбор не может быть осуществлен.'");
		Сообщение.Сообщить();
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	
	
	Элементы.Настройка.РежимВыбораИзСписка = Истина;

КонецПроцедуры

&НаКлиенте
Процедура НастройкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		//выбор вида настройки
		Если ВыбранноеЗначение = "Норма расхода ГСМ" Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
			ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
			ПараметрыФормы.Вставить("РежимВыбора", Истина);

			Если Запись.ВидОбъектаРасходаГСМ = ПредопределенноеЗначение("Перечисление.ВидыОбъектовРасходаГСМ.ТранспортныеСредства") Тогда
				ОткрытьФорму("Справочник.НормыРасходаГСМ.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
			ИначеЕсли Запись.ВидОбъектаРасходаГСМ = ПредопределенноеЗначение("Перечисление.ВидыОбъектовРасходаГСМ.Агрегаты") Тогда
				ОткрытьФорму("Справочник.НормыРасходаГСМДляАгрегатов.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
			КонецЕсли;	
		ИначеЕсли ВыбранноеЗначение = "Поправочное значение расхода ГСМ" Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
			ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
			ПараметрыФормы.Вставить("РежимВыбора", Истина);
			ПараметрыФормы.Вставить("ВидОбъектаРасходаГСМ", Запись.ВидОбъектаРасходаГСМ);

			ОткрытьФорму("Справочник.ПоправочныеЗначенияРасчетаНормГСМ.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
		ИначеЕсли ВыбранноеЗначение = "Поправочный коэффициент расхода ГСМ" Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
			ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
			ПараметрыФормы.Вставить("РежимВыбора", Истина);
			ПараметрыФормы.Вставить("ВидОбъектаРасходаГСМ", Запись.ВидОбъектаРасходаГСМ);

			ОткрытьФорму("Справочник.ПоправочныеКоэффициентыРасчетаНормГСМ.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
		КонецЕсли;
		
		Элементы.Настройка.РежимВыбораИзСписка = Ложь;
	Иначе
		//выбор настройки
		Запись.Настройка = ВыбранноеЗначение;
	Конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура ДействуетДоПревышенияПробегаПриИзменении(Элемент)
	Если Запись.ДействуетДоПревышенияПробега Тогда
		Запись.ДействуетПослеПревышенияПробегаИлиПредельногоСрокаЭксплуатации = Ложь;
		
		Если Запись.НачалоПериодаКонтроляПробега = Дата(1,1,1) Тогда
			Запись.НачалоПериодаКонтроляПробега = ДатаВводаВЭксплуатацию;
		КонецЕсли;	
	КонецЕсли;
	
	УстановитьВидимостьЭлементов(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДействуетПослеПревышенияПробегаИлиПредельногоСрокаЭксплуатацииПриИзменении(Элемент)
	Если Запись.ДействуетПослеПревышенияПробегаИлиПредельногоСрокаЭксплуатации Тогда
		Запись.ДействуетДоПревышенияПробега = Ложь;
		
		Если Запись.НачалоПериодаКонтроляПробега = Дата(1,1,1) Тогда
			Запись.НачалоПериодаКонтроляПробега = ДатаВводаВЭксплуатацию;
		КонецЕсли;	
	КонецЕсли;
	
	УстановитьВидимостьЭлементов(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТСПриИзменении(Элемент)
	ТСПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаРасходаГСМПриИзменении(Элемент)
	УстановитьВидимостьЭлементов(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Запись = Форма.Запись;
	
	Если Запись.ВидОбъектаРасходаГСМ = ПредопределенноеЗначение("Перечисление.ВидыОбъектовРасходаГСМ.ТранспортныеСредства") Тогда
		ПоказыватьДопНастройки = Истина;	
	Иначе
		ПоказыватьДопНастройки = Ложь;	
	КонецЕсли;	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
	"ГруппаДополнительныеУсловияПрименения", "Видимость", ПоказыватьДопНастройки);
	
	ДействуетДоПревышенияПробега = Запись.ДействуетДоПревышенияПробега;
	ДействуетПослеПревышенияПробегаИлиПредельногоСрокаЭксплуатации = Запись.ДействуетПослеПревышенияПробегаИлиПредельногоСрокаЭксплуатации;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
	"ГруппаДействуетДоПревышенияПробега", "Видимость", ДействуетДоПревышенияПробега);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
	"ГруппаДействуетПослеПревышенияПробегаИлиПредельногоСрокаЭксплуатации", "Видимость", ДействуетПослеПревышенияПробегаИлиПредельногоСрокаЭксплуатации);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкуДляБыстрогоЗаполненияПоВариантам(Форма, ИмяРеквизита, ГруппаРеквизита)
	
	ИмяКоманды = "Заполнить" + ИмяРеквизита;  
	Команда = Форма.Команды.Добавить(ИмяКоманды);
	Команда.Отображение = ОтображениеКнопки.Картинка;
	Команда.Действие = НСтр("ru = 'ОбработкаНажатияКнопкиЗаполненияПоВариантам'");
	
	Элемент = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаРеквизита);
	Элемент.ИмяКоманды = ИмяКоманды;
	
	Элемент.Заголовок = НСтр("ru = 'Заполнить настройки предельных сроков и пробега по предопределенным вариантам'");
	Команда.Подсказка = НСтр("ru = 'Заполнить настройки предельных сроков и пробега по предопределенным вариантам'");
	Команда.Картинка = БиблиотекаКартинок.ПереместитьВниз;
	Команда.ИзменяетСохраняемыеДанные = Истина;
	
КонецПроцедуры

&НаСервере
Функция СписокЗначенийПоВариантам()
	СписокЗначенийПоВариантам = Новый СписокЗначений;
	СписокЗначенийПоВариантам.Добавить(5, "Более 5 лет с даты ввода в эксплуатацию или с пробегом более 100 000 км");
	СписокЗначенийПоВариантам.Добавить(8, "Более 8 лет с даты ввода в эксплуатацию или с пробегом более 150 000 км");
	
	Возврат СписокЗначенийПоВариантам;
КонецФункции	

&НаКлиенте
Процедура ОбработкаНажатияКнопкиЗаполненияПоВариантам(КомандаФормы)
	Элемент = ЭтаФорма.Элементы.Найти(КомандаФормы.Имя);
	СписокЗначенийПоВариантам = СписокЗначенийПоВариантам();
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеЗаполненияПредельнойДаты", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ЭтаФорма.ПоказатьВыборИзМеню(Оповещение, СписокЗначенийПоВариантам, Элемент);
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьПослеЗаполненияПредельнойДаты(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДатаВводаВЭксплуатацию = Дата(1,1,1) Тогда
		//дата ввода в эксплуатацию не определена
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Для транспортного средства дата ввода в эксплуатацию не определена. Требуется указать дату начала периода вручную.'");
		Сообщение.Сообщить();
			
		Возврат;
	КонецЕсли;	
	
	ПредельнаяДата = ДобавитьМесяц(ДатаВводаВЭксплуатацию + 86400, 12 * ВыбранныйЭлемент.Значение); 
	
	ИмяРеквизита = Сред(ДополнительныеПараметры.Элемент.Имя, 10);
	Запись[ИмяРеквизита] = ПредельнаяДата;
	
	Если ВыбранныйЭлемент.Значение = 5 Тогда
		Запись["ПредельныйПробег"] = 100000;
		Запись["ПредельныйПробегОкончанияДействия"] = 150000;
		Запись["ПредельнаяДатаОкончанияДействия"] = ДобавитьМесяц(ДатаВводаВЭксплуатацию, 12 * 8); ;
	ИначеЕсли ВыбранныйЭлемент.Значение = 8 Тогда	
		Запись["ПредельныйПробег"] = 150000;
		Запись["ПредельныйПробегОкончанияДействия"] = 0;
		Запись["ПредельнаяДатаОкончанияДействия"] = Дата(1,1,1); ;
	КонецЕсли;	
КонецПроцедуры	


&НаСервере
Процедура СоздатьКнопкуДляБыстрогоЗаполненияДатыКонтроляПробега(Форма, ИмяРеквизита, ГруппаРеквизита)
	
	ИмяКоманды = "Заполнить" + ИмяРеквизита;  
	Команда = Форма.Команды.Добавить(ИмяКоманды);
	Команда.Отображение = ОтображениеКнопки.Картинка;
	Команда.Действие = НСтр("ru = 'ОбработкаНажатияКнопкиЗаполненияДатыКонтроляПробега'");
	
	Элемент = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаРеквизита);
	Элемент.ИмяКоманды = ИмяКоманды;
	
	Элемент.Заголовок = НСтр("ru = 'Заполнить дату начала контроля пробега'");
	Команда.Подсказка = НСтр("ru = 'Заполнить дату начала контроля пробега'");
	Команда.Картинка = БиблиотекаКартинок.ПереместитьВлево;
	Команда.ИзменяетСохраняемыеДанные = Истина;
	
КонецПроцедуры

&НаСервере
Функция СписокЗначенийДатыКонтроляПробега()
	СписокЗначенийДатыКонтроляПробега = Новый СписокЗначений;
	СписокЗначенийДатыКонтроляПробега.Добавить("ДатаВводаВЭксплуатацию", "Дата ввода в эксплуатацию");
	СписокЗначенийДатыКонтроляПробега.Добавить("ДатаПоследнегоКапРемонта", "Дата последнего капитального ремонта");
	
	Возврат СписокЗначенийДатыКонтроляПробега;
КонецФункции	

&НаКлиенте
Процедура ОбработкаНажатияКнопкиЗаполненияДатыКонтроляПробега(КомандаФормы)
	Элемент = ЭтаФорма.Элементы.Найти(КомандаФормы.Имя);
	СписокЗначенийДатыКонтроляПробега = СписокЗначенийДатыКонтроляПробега();
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеЗаполненияДатыКонтроляПробега", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ЭтаФорма.ПоказатьВыборИзМеню(Оповещение, СписокЗначенийДатыКонтроляПробега, Элемент);
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьПослеЗаполненияДатыКонтроляПробега(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаЗаполнения = Дата(1,1,1);
	Если ВыбранныйЭлемент.Значение = "ДатаВводаВЭксплуатацию" Тогда
		Если ДатаВводаВЭксплуатацию = Дата(1,1,1) Тогда
			//дата ввода в эксплуатацию не определена
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Для транспортного средства дата ввода в эксплуатацию не определена. Требуется указать дату начала периода вручную.'");
			Сообщение.Сообщить();
			
			Возврат;
		КонецЕсли;	
		ДатаЗаполнения = ДатаВводаВЭксплуатацию;
	ИначеЕсли ВыбранныйЭлемент.Значение = "ДатаПоследнегоКапРемонта" Тогда
		ДанныеОПоследнемКапРемонте = ДанныеОПоследнемКапРемонте();
		ДатаЗаполнения = ДанныеОПоследнемКапРемонте.ДатаКапремонта;
		ЗаполненаДатаФактическогоРемонта = ДанныеОПоследнемКапРемонте.ЕстьДатаОкончания;
		СсылкаНаДокументРеконструкция = ДанныеОПоследнемКапРемонте.Ссылка;
		
		Если ДатаЗаполнения = Дата(1,1,1) Тогда
			//дата последнего кап. ремонта не определена
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Для транспортного средства дата капитального ремонта не определена. Требуется указать дату начала периода вручную.'");
			Сообщение.Сообщить();
			
			Возврат;
		КонецЕсли;	
		Если НЕ ЗаполненаДатаФактическогоРемонта Тогда
			//не заполнена дата фактического окончания работ по кап.ремонту
			Сообщение = Новый СообщениеПользователю;
			ТекстОшибки = НСтр("ru='В документе %1 на закладке ""Акт"" не указана дата фактического окончания ремонта. Начало периода заполнено датой документа. Требуется указать дату начала периода вручную, если дата окончания ремонта отличается от даты документа.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СсылкаНаДокументРеконструкция);
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
		КонецЕсли;	
	КонецЕсли;	
	
	ИмяРеквизита = Сред(ДополнительныеПараметры.Элемент.Имя,10);
	Запись[ИмяРеквизита] = ДатаЗаполнения; 
	
КонецПроцедуры	

&НаСервере
Функция ДанныеОПоследнемКапРемонте()
	Результат = Новый Структура;
	Результат.Вставить("ДатаКапремонта", Дата(1,1,1));
	Результат.Вставить("ЕстьДатаОкончания", Ложь);
	Результат.Вставить("Ссылка", Документы.ТипВсеСсылки());
	
	Организация = Запись.Организация;
	ОС = Запись.ТС;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РеконструкцияОС.Ссылка,
	               |	ВЫБОР
	               |		КОГДА РеконструкцияОС.ДатаОкончания = &ПустаяДата
	               |			ТОГДА РеконструкцияОС.Дата
	               |		ИНАЧЕ РеконструкцияОС.ДатаОкончания
	               |	КОНЕЦ КАК ДатаОкончанияРемонта,
	               |	ВЫБОР
	               |		КОГДА РеконструкцияОС.ДатаОкончания = &ПустаяДата
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЗаполненаДатаФактическогоРемонта
	               |ПОМЕСТИТЬ КапРемонты
	               |ИЗ
	               |	Документ.РеконструкцияОС КАК РеконструкцияОС
	               |ГДЕ
	               |	РеконструкцияОС.Проведен = ИСТИНА
	               |	И РеконструкцияОС.ВидОперации = &ВидОперацииКапРемонта
	               |	И РеконструкцияОС.ОсновныеСредства.ОсновноеСредство = &ОсновноеСредство
	               |	И РеконструкцияОС.Организация = &Организация
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеконструкцияИК.Ссылка,
	               |	ВЫБОР
	               |		КОГДА РеконструкцияИК.ДатаОкончания = &ПустаяДата
	               |			ТОГДА РеконструкцияИК.Дата
	               |		ИНАЧЕ РеконструкцияИК.ДатаОкончания
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА РеконструкцияИК.ДатаОкончания = &ПустаяДата
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.РеконструкцияИК КАК РеконструкцияИК
	               |ГДЕ
	               |	РеконструкцияИК.ОсновныеСредства.ОсновноеСредство = &ОсновноеСредство
	               |	И РеконструкцияИК.Организация = &Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КапРемонты.Ссылка,
	               |	КапРемонты.ДатаОкончанияРемонта,
	               |	КапРемонты.ЗаполненаДатаФактическогоРемонта
	               |ИЗ
	               |	КапРемонты КАК КапРемонты";
				   
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1)); 			   
	Запрос.УстановитьПараметр("ВидОперацииКапРемонта", Перечисления.ВидыОперацийРеконструкцияОС.КапРемонтОС); 			   
	Запрос.УстановитьПараметр("Организация", Запись.Организация); 			   
	Запрос.УстановитьПараметр("ОсновноеСредство", Запись.ТС); 			   
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.ДатаКапремонта = Выборка.ДатаОкончанияРемонта;	
		Результат.ЕстьДатаОкончания = Выборка.ЗаполненаДатаФактическогоРемонта;
		Результат.Ссылка = ?(Выборка.ДатаОкончанияРемонта = Дата(1,1,1), Неопределено, Выборка.Ссылка);	
	КонецЕсли;	
				   
	Возврат Результат;
КонецФункции	

&НаСервере
Функция ДатаВводаВЭксплуатациюТС()
	Результат = Дата(1, 1, 1);
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("Организация", Запись.Организация);
	ПараметрыПроверки.Вставить("ОсновноеСредство", Запись.ТС);
	ПараметрыПроверки.Вставить("Период", КонецДня(ТекущаяДата()));
	
	ПроверяемыеСобытия = Новый Массив;
	ПроверяемыеСобытия.Добавить(Перечисления.ВидыСобытийОС.ВводВЭксплуатацию);
	ПараметрыПроверки.Вставить("Событие", ПроверяемыеСобытия);
	ТаблицаСобытийОС = УправлениеОсновнымиСредствами.ПолучитьСобытияОС(ПараметрыПроверки);
	
	КоличествоСтрок = ТаблицаСобытийОС.Количество();
	Если КоличествоСтрок>0 Тогда
		Результат = ТаблицаСобытийОС[КоличествоСтрок-1].ДатаСобытия; 
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ТСПриИзмененииНаСервере()
	ДатаВводаВЭксплуатацию = ДатаВводаВЭксплуатациюТС();
КонецПроцедуры

#КонецОбласти
